Core/src/src/Documents/Импорт/Импорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Импорт</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьЗакупки</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИмпортаA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИмпортаC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалогаНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИмпорта</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DocumentRef.ПриходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИмпорта</name>
      <type>
        <types>CatalogRef.ПроцентыИмпорта</types>
      </type>
    </attributes>
    <attributes>
      <name>БазаИмпорта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИмпорта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПроцентаИмпорта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходовНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СуммыРаспределения</name>
    <attributes>
      <name>СтавкаНалога</name>
      <type>
        <types>CatalogRef.ПроцентыИмпорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазаИмпорта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/Импорт/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаИмпорт, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаИмпорт);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	Запрос.УстановитьПараметр("ТранзитныйСклад", Истина);
	
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Импорт.Ссылка,
	|	Импорт.Номер,
	|	Импорт.Дата КАК Период,
	|	Импорт.Организация,
	|	Импорт.НомерИмпортаA,
	|	Импорт.НомерИмпортаC,
	|	Импорт.СуммаНДС,
	|	Импорт.ВидНалогаНДС,
	|	&ВалютаУчета КАК Валюта,
	|	Импорт.ВидНалогаНДС.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюНДСРегл,
	|	Импорт.ВидНалогаНДС.СчетУчетаРегл КАК СчетУчетаНДСРегл,
	|	Импорт.ВидИмпорта
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.Импорт КАК Импорт
	|ГДЕ
	|	Импорт.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИмпортЗапасы.Ссылка,
	|	ИмпортЗапасы.НомерСтроки,
	|	ИмпортЗапасы.Ссылка.Дата КАК Период,
	|	&ВалютаУчета КАК Валюта,
	|	ИмпортЗапасы.Ссылка.Организация КАК Организация,
	|	ИмпортЗапасы.ДокументПоступления,
	|	ИмпортЗапасы.ДокументПоступления.Контрагент КАК Контрагент,
	|	ИмпортЗапасы.ДокументПоступления.Подразделение КАК Подразделение,
	|	ИмпортЗапасы.Номенклатура,
	|	ИмпортЗапасы.Номенклатура.СчетУчетаЗапасов КАК СчетУчетаЗапасов,
	|	ВЫБОР
	|		КОГДА ИмпортЗапасы.ДокументПоступления.СтруктурнаяЕдиница.ТранзитныйСклад = &ТранзитныйСклад
	|			ТОГДА ИмпортЗапасы.ДокументПоступления.СтруктурнаяЕдиница.СчетУчетаРегл
	|		ИНАЧЕ ИмпортЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|	КОНЕЦ КАК СчетУчетаЗапасовРегл,
	|	ИмпортЗапасы.Характеристика,
	//ПодольскийАИ 30.09.2021 {
	|	Выбор
	|		Когда Не &УчетПоПроектам
	|			Тогда Значение(Справочник.Проекты.ПустаяСсылка)
	|		Когда ИмпортЗапасы.Проект = Значение(Справочник.Проекты.ПустаяСсылка)
	|			Тогда Значение(Справочник.Проекты.БезПроекта)
	|		Иначе ИмпортЗапасы.Проект
	|	Конец КАК Проект,
	//ПодольскийАИ 30.09.2021 }
	// Олег Литвиненко 23.05.23 --->
	|	ИмпортЗапасы.Партия,
	// Олег Литвиненко <---
	|	ИмпортЗапасы.Количество,
	|	ИмпортЗапасы.ЕдиницаИзмерения,
	|	ИмпортЗапасы.Цена,
	|	ИмпортЗапасы.Ссылка.ВидНалогаНДС КАК ВидНалогаНДС,
	|	ИмпортЗапасы.Сумма,
	|	ИмпортЗапасы.СуммаРасходовНДС,
	|	ИмпортЗапасы.СтавкаНДС,
	|	ИмпортЗапасы.ПроцентИмпорта,
	|	ИмпортЗапасы.БазаИмпорта,
	|	ИмпортЗапасы.СуммаИмпорта,
	|	ИмпортЗапасы.ЗначениеПроцентаИмпорта,
	|	ИмпортЗапасы.Ссылка.ВидНалогаНДС.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюНДСРегл,
	|	ИмпортЗапасы.Ссылка.ВидНалогаНДС.СчетУчетаРегл КАК СчетУчетаНДСРегл,
	|	ИмпортЗапасы.Ссылка.ВидИмпорта КАК ВидНалога,
	|	ИмпортЗапасы.Ссылка.ВидИмпорта.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ИмпортЗапасы.Ссылка.ВидИмпорта.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
	|	ИмпортЗапасы.ДокументПоступления.СтруктурнаяЕдиница КАК Склад
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.Импорт.Запасы КАК ИмпортЗапасы
	|ГДЕ
	|	ИмпортЗапасы.Ссылка = &Ссылка";
	
	Запрос.ВыполнитьПакет();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаЗапасы(ДокументСсылкаИмпорт, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаИмпорт, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_Импорт(ДокументСсылкаИмпорт, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьСебестоимостьЗакупки_Импорт(ДокументСсылкаИмпорт, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура СформироватьТаблицаЗапасы(ДокументСсылкаИмпорт, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.Склад КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчетаЗапасов КАК СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	|	ТаблицаЗапасы.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	// Олег Литвиненко 23.05.23 --->
	|	ТаблицаЗапасы.Партия КАК Партия,
	// Олег Литвиненко <---
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	&ОприходованиеЗапасов КАК СодержаниеПроводки,
	|	0 КАК Количество,
	|	СУММА(ТаблицаЗапасы.СуммаИмпорта) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.СуммаИмпорта <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Склад,
	|	ТаблицаЗапасы.СчетУчетаЗапасов,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	// Олег Литвиненко 23.05.23 --->
	|	ТаблицаЗапасы.Партия,
	// Олег Литвиненко <---
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	|	ТаблицаЗапасы.Проект";
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	//|	ТаблицаЗапасы.Партия,
	//|	ТаблицаЗапасы.ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасы()

Процедура СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаИмпорт, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаРасчетыПоНалогам.Период КАК Период,
	|	ТаблицаРасчетыПоНалогам.Организация КАК Организация,
	//|	ТаблицаРасчетыПоНалогам.ВидНалогаНДС КАК ВидНалога,
	|	ТаблицаРасчетыПоНалогам.Ссылка.ВидИмпорта КАК ВидНалога,
	|	&НачислениеНалогаИмпорт КАК СодержаниеПроводки,
	|	СУММА(ТаблицаРасчетыПоНалогам.СуммаИмпорта) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаРасчетыПоНалогам
	|ГДЕ
	|	ТаблицаРасчетыПоНалогам.СуммаИмпорта <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасчетыПоНалогам.Период,
	|	ТаблицаРасчетыПоНалогам.Организация,
	|	ТаблицаРасчетыПоНалогам.Ссылка.ВидИмпорта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаРасчетыПоНалогам.Период,
	|	ТаблицаРасчетыПоНалогам.Организация,
	|	ТаблицаРасчетыПоНалогам.ВидНалогаНДС,
	|	&НачислениеНалогаНДС,
	|	СУММА(ТаблицаРасчетыПоНалогам.СуммаРасходовНДС)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаРасчетыПоНалогам
	|ГДЕ
	|	ТаблицаРасчетыПоНалогам.СуммаРасходовНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасчетыПоНалогам.Организация,
	|	ТаблицаРасчетыПоНалогам.Период,
	|	ТаблицаРасчетыПоНалогам.Организация,
	|	ТаблицаРасчетыПоНалогам.ВидНалогаНДС";
	
	Запрос.УстановитьПараметр("НачислениеНалогаНДС", НСтр("ka='დღგ-ს დარიცხვა';ru='Начисление налога НДС';en='Accrual of VAT'"));
	Запрос.УстановитьПараметр("НачислениеНалогаИмпорт", НСтр("ka='იმპორტის გადასახადის დარიცხვა';ru='Начисление налога импорта';en='Accrual of import tax'"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", РезультатЗапроса[0].Выгрузить());
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", РезультатЗапроса[1].Выгрузить());
	
КонецПроцедуры
